content/posts/trains-the-state-of-not-being.md
+++
title = "Trains The State Of Not Being"
date = 2020-06-17
lastmod = 2020-06-18T06:55:48+03:00
tags = ["travel", "philosophy"]
categories = ["rants"]
draft = false
weight = 2003
featuredImage = "/images/train-cars.jpg"
+++

Tis strange, but it is certainly true to some extent: being on trains is like being in another plane of existence: it is a separate social place, with ever changing, ever moving background. Because of the vast space it encompasses, it does not feel like a vehicle, it feels like another moving world.


## The Feeling of a New Start {#the-feeling-of-a-new-start}

Every time I embark on a train trip, I feel like I'm going to start my life over, like a hopeful lad who tries he's fortune in the New World. To be completely oblivious to your past, to not be crippled by anxiety of tomorrow: this is what I mean.
And this isn't only the case when I visit a new city, this happens every time I travel beetween my home town and my university town.


## Being slow isn't all that bad {#being-slow-isn-t-all-that-bad}

Also, in a perverted way, I enjoy the fact the trains here in Romania are so awfully slow. You can truly get into the state where you are completely disconnected from your everyday woes and problems, and could also get an outsider perspective on them.
For example, I'm anxious about talking to my landlord, because my roommates have
moved out, and I don't know if I can keep the apartment for the summer, if I'm
the only one paying for it. But here I am, fantasizing about getting a job in
Italy or Germany, just for the sake of getting to know the historical parts of Europe.


## Train-friendships {#train-friendships}

Train friendships are a magical phenomena. Well of course, we all look at our
phones, but once in a while we just can't help but to strike  a conversation
with the person sitting one meter away from us. Well, I'm not doing that just
right know, because I'm writing, but if I have that kind of traveling mate, it
really could make the trip go so much easier.
The most beautiful things about these friendships are the fact that they only
exist on the train. Most probably you will never speak again with this person,
nor will you see them ever again. It's  a precious magic, and we should
appreciate the fact that it exists. After one of you arrives at his or her
station you say goodbye, and after a  few minutes it will seem like that you
have only dreamed this whole thing, and your mind is playing tricks on you. It's
kind of like festival-friendships, with the difference that your background
changes and moves without you taking drugs, which is pretty cost effective, if
you ask me!


## Nature {#nature}

This also makes me appreciate more the Transylvanian landscape, which I have to
say, it's pretty gorgeous every time. I've been on the DiscoverEU program with
my pal last year, and I have to say, there was rarely a time when we were in awe
because of the landscape we saw. The Czech Republic was especially bland, but
the boring crown has to go the Netherlands: at first it was pretty astonishing
to see just how FLAT can a piece of country get if it really sets itself to it,
but after that initial reaction our emotions were replaced with the **meh**. Allow
me to be patriotic about the nature of my homeland, because it is truly beautiful.


## Trains make us perpetual children {#trains-make-us-perpetual-children}

I think I'm drawn to trains because me and my parents used to travel exclusively
by train when I was little. My didn't see the need for a car, nor were we in the
situation financially to get one. So we "trained", and boi, I don't really
regret it! My favourite types of trains were the ones with a second floor. I
called them "froggy trains" for some reason, and I don't really know why.
I don't remember sadly much of my pre-school childhood, which was a happy period
of my life, but traveling by train somehow gives me some flashbacks about the
things I've felt as a little human.


## Books {#books}

Reading on trains is the best. Especially if you're surrounded by fellow
students or just people who have business in some other city. This is sadly only
possible on long distance trains. Local trains often smell of piss, and it's
travelers listen to garbage music loudly, without headphones, and drink beer out
of plastic bottles.
But setting that aside, these kinds of trips give the possibility of a
meditative book reading experience. My favourite reads on train were Murakami
Haruki's short stories, and "The Red Haired Woman" by Orhan Pamuk.


## Final remarks {#final-remarks}

I've been a lifelong train fan, and always will be. It is my favorite mean of
transportation, a strange mixture of a vehicle and a social space where you can
be who you want to be, free from the pressure of the fast-paced reality which
suffocates many of us from day to day. Or I'm just too poetic about it, and
should get my lazy ass to finish driving school. Who knows? Maybe you do. Give
me your input on this!


### Attributions: {#attributions}

_Thumbnail image: [Train Double decked Railway](https://www.needpix.com/photo/1465915/train-doubledecked-railway-commerce-trains), by Linnaea Mallette (Public Domain)_
